<template>
  <div class="page-clause">
    <div class="logo-line">
      <i @click="$router.push('/')" class="icon-logo"></i>
    </div>
    <div class="clause-info">
      <span class="info-title">孕安服务条款</span>
      <div class="info-desc">
        <p>
          欢迎您使用码上有喜（”我们"）的产品和/或服务，我们非常重视和保护您的隐私信息和您的个人信息。 孕安平台 是指由 【杭州码上有喜科技有限公司】及其关联公司 享有所有权和/或运营权的【码上有喜网站（msyx.info）】以及移动应用【孕安 APP】的统称。
          <br />本隐私政策适用于您通过任何方式使用码上有喜平台提供的全部产品和/或服务（本隐私政策中统称为码上有喜平台服务）的使用而提供或留存的信息，我们希望通过本隐私政策向您说明在您码上有喜平台服务时，我们是如何收集、使用、保存、共享和转让这些信息，以及我们将为您提供访问、更新、删除、保护以及注销这些信息的方式。
          <br />
          <br />请您在继续使用码上有喜产品或服务前务必认真仔细阅读并确认充分理解本隐私政策全部规则和要点，并确认您已经充分理解本隐私政策所写明的内容（重点内容我们均用粗体或下划线方式表示）。一旦您选择使用或在我们更新本隐私政策后（我们会及时提示您更新的情况）继续使用我们的产品和服务，即视为您同意本隐私政策（含更新版本）的全部内容，同意我们按本隐私政策收集、使用、共享和处理您的相关信息。
          <br />如您对本隐私政策有任何疑问，可通过本隐私政策第八章节【如何联系我们】或者码上有喜 APP 中的【联系客服】向我们进行反馈。如您不同意相关协议或其中的任何条款的，您应停止使用我们的产品和/或服务。
          <br />
          <br />本隐私政策帮助您了解以下内容：
          <br />&emsp;&emsp;一. 我们如何收集和使用您的个人信息
          <br />&emsp;&emsp;二. 我们如何使用 Cookie 和其他追踪技术；
          <br />&emsp;&emsp;三. 我们如何共享、转让、公开披露您的个人信息；
          <br />&emsp;&emsp;四. 我们如何存储保存和保护您的个人信息；
          <br />&emsp;&emsp;五. 您的权利；
          <br />&emsp;&emsp;六. 我们如何处理未成年人的个人信息；
          <br />&emsp;&emsp;七. 如何更新本政策；
          <br />&emsp;&emsp;八. 如何联系我们；
          <br />&emsp;&emsp;九. 争议解决；
          <br />&emsp;&emsp;十. 定义和名词解释。
          <br />我们深知个人信息对您的重要性，并会尽全力保护您的个人信息安全可靠。我们致力于维持您对我们的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，我们承诺将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。
          <br />一、我们如何收集和使用您的个人信息
          <br />前言：
          <br />1. 个人信息是指以电子或者其他方式记录的能够单独或者与其他信息，结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。如姓名、出生日期、身份证件号 码、个人生物识别信息、住址、通信通讯联系方式、通信记录和内容、账号密码、财产信息、征信信息、行踪轨迹、住宿信息、健康生理信息、交易信息等。具体的关于个人信息的定义以及本隐私政策将涉及到的个人信息，将通过本隐私政策如下具体内容的阐述以及第十章节的定义和名词解释进行明确。
          <br />2. 我们会根据本隐私政策的约定，为实现我们的产品和/或服务功能而对所收集的个人信息进行使用。
          <br />3. 在收集您的个人信息后，我们将通过技术手段对数据进行去标识化处理，去标识化处理的信息将不含可识别到具体个人身份的信息。请您了解并同意，在此情况下我们有权使用已经去标识化的信息；并在不透露您个人信息的前提下，我们有权对用户数据库进行分析并予以商业化的利用。
          <br />4. 我们会对我们的产品与 / 或服务使用情况进行统计，并可能会与公众或第三方共享这些统计信息，以展示我们的产品与 / 或服务的整体使用趋势。但这些统计信息将进行匿名化处理，不包含您的任何身份识别信息。
          <br />5. 在您选择公开您的问答内容而需展示您的个人信息时，我们会采用打码、替换、匿名处理方式对您的信息进行脱敏，使您不可被直接识别以保护您的信息安全。
          <br />我们将在以下情况或出于以下目的，收集和使用您的个人信息：
          <br />（一）注册、登录
          <br />1、您账号注册成功后，您可以补充您的头像、昵称、性别、城市、生日、个性签名以及您实名验证的相关信息，这些信息均属于您的"账号信息"，同时如果您提供该等信息，将有助于更好地帮助我们提供更好的服务和体验。但如果您不提供这些补充和额外信息，将不会影响使用本服务的基本功能。
          <br />2、注册会员服务：我们会根据您的码上有喜平台账户使用情况及平台设置的账户等级计算规则确定您当前的等级，并为您提供相应账户等级所对应的基本权益。如果您选择提供真实姓名、性别、出生日期、居住地、昵称、头像等非注册必须的个人资料，我们可以为您提供会员生日特权等更加个性化的会员服务。其中，如果您提供昵称和头像的，您的昵称、头像将公开显示。
          <br />3、实名认证：您可以根据认证要求提供相应的身份信息（身份证、护照、户口簿及其他身份证件信息）、生物识别特征（静态或动态的面部特征）以完成实名认证。若您需使用账户增强保护功能，除上述实名认证方式外，您还可以选择开启声纹、指纹密保或者扫脸登录，提供声纹、指纹、虹膜识别信息或者面部特征信息。
          <br />4、授权登录：我们可能经您同意后向第三方共享您的账户信息（头像、昵称及其他页面提示的信息），使您可以便捷地实现第三方账户的注册或第三方处直接登录。此外，我们可能会根据您的授权从微信、支付宝等第三方处获取您的第三方账户信息，并与您的码上有喜平台账户进行绑定，使您可在第三方处直接登录、使用我们的产品及/或服务。我们将在您授权同意的范围内使用您的相关信息。
          <br />5、如果您已拥有码上有喜平台账户，我们可能会在码上有喜平台服务中显示您的上述个人信息（实人认证仅显示认证是否通过的结果），以及您在码上有喜平台上或与码上有喜平台账户相关联的产品和服务中执行的操作，包括通过码上有喜平台账户集中展示您的个人资料、优惠权益、交易订单。我们会尊重您对码上有喜平台服务和码上有喜平台账户设置所做的选择。
          <br />6 、如您不注册账号，可通过微信和 Apple 登录这两种第三方平台授权登录，我们仍然需要绑定您的电话号码，通过电话号码来验证您的身份是否有效。
          <br />7 、如您拒绝提供手机号码或身份证号码进行实名验证以及上述个人敏感信息的，将可能导致注册不成功，您可以退出注册页面后进入码上有喜平台，仅浏览平台内的相关信息内容，但不可进行任何其它的操作或接受平台提供的核心服务等（如下第（二）节我们为您提供的产品和 / 或服务中的相关内容）。
          <br />（二）向您提供产品和 / 或服务
          <br />1 、码上有喜提供信息展示以及信息搜索浏览功能
          <br />(1) 码上有喜平台提供丰富的医疗医药健康内容咨询（包括医院、科室、医生等的信息、健康科普内容、公开问答内容、用户评论）、商品信息或图文内容信息用户评论等信息等等供您浏览阅读。为此，在您进行信息浏览时，我们可能会收集您在使用该等服务时的 设备信息，包括设备名称、设备型号、唯一设备识别码、操作系统版本和应用程序版本、语言设置、分辨率、电信运营商信息、服务提供商网络 ID （ PLMN ）、浏览器类型来为您提供信息内容展示的最优方式，我们也会为了不断改进和优化上述功能而使用您的上述信息。
          <br />(2) 同时在您进行浏览时，还可根据个人需求和喜好选择搜索服务，通过搜索关键词精准找寻内容。 为了提供该等个性化搜索喜好与内容的精准搜索并优化搜索服务以及依法留存网络服务日志 ，我们将可能收集您的 日志信息 并作为网络日志保存，可能包括 您输入的搜索关键词信息和点击的链接，您发布的评论，咨询的相关问题，对我们服务的反馈与评价，您上传的文字资料、图片、视频等信息以及您的 IP 地址、您访问服务的日期、时间、时长。
          <br />请您注意 ，单独的设备信息、浏览器类型信息或单独的搜索关键词信息无法单独识别您的身份，不属于您的个人信息，我们有权以任何的目的对其进行使用；只有当您的设备信息、浏览器类型信息或搜索关键词信息与您的其他信息相互结合使用并可以识别您的身份时，则在结合使用期间，我们会将该等信息作为您的个人信息，与您的搜索历史记录一同按照本隐私政策对其进行处理与保护。
          <br />2 、在线健康咨询或在线问诊功能
          <br />码上有喜平台提供在线健康咨询和在线问诊功能，在您成为注册用户后，您可在码上有喜平台进行健康咨询或在线问诊，包括图文 、电话、视频等方式向医生进行提问，并对医生的回答进行评论等，包括自愿加入医生的患者关爱目录等。使用此服务，我们可能需收集患者信息，包括 患者姓名、性别、身份证号码、出生日期、体重、病情、既往病史、过敏史、肝肾功能、患者就诊资料 用于对患者咨询问题或病情进行诊断。如您不提供该等信息，根据相关法律规定，你将无法取得本服务。同时在问诊过程中，可能会向您申请同意开启 手机拍摄、读取相册、录音、读取外部存储及写入外部存储 的相关权限，于用问诊过程相关资料的传输。
          <br />3 、处方开药功能
          <br />作为可提供互联网诊疗服务的平台，我们可提供线上问诊处方开药功能，作为注册用户，您可在码上有喜平台选择开药问诊服务或者在您问诊后根据医生为您开具的用药处方，在平台进行线上购药。使用此服务，我们可能需收集 同上述第 2 点【在线问诊】功能中列明的个人信息（否则无法判断病情提供处方）。为了完成处方开药功能，完成药品的购买与配送 ，需要您进行支付，具体需要收集的信息见下述第 7点【支付功能和交付产品】详述。
          <br />4 、成长测评服务
          <br />成长测评服务为码上有喜为家有 0-6 岁儿童提供的关于成长发育测评的服务。该等服务的接受对象为 0-6 岁的儿童。因此需由作为监护人的您确认并同意使用该等服务，且 由监护人同意向我们平台提供儿童的姓名、性别、出生年月、血型、慢病情况等健康状况、以及身高体重等基本生理情况从而为儿童提供专业成长测评服务。
          <br />5 、孕育管家服务
          <br />孕育管家服务码上有喜平台为不同阶段的孕育人士提供相对应阶段的健康科普及专业健康知识，该等服务需收集您的目前的 孕育阶段情况、预产期、育儿中的宝宝性别、生日、血型、健康状况从而提供为您提供匹配的科学的孕育管家服务功能。
          <br />6、医疗健康服务预约
          <br />医疗健康服务以及相关预约服务（包括但不限于各类医疗服务、疫苗接种、核酸检测等服务）均由本平台中入驻第三方线下实体医疗机构或者具备提供相应服务资质的服务机构（下称第三方服务机构）向您提供。您在本平台预约上述相关服务时，需向本平台提供并同意由本平台向您所预约的第三方服务机构共享您的下述个人信息： 姓名、电话、身份证号码、因相应的医疗服务所需的特定个人基础健康信息等 。
          <br />7 、为您提供商品购买服务
          <br />当您选择在码上有喜平台中使用商品购买浏览服务时，码上有喜平台可能会收集以下相关信息：
          <br />（ 1 ）下单
          <br />当您准备对您购物车内的商品进行结算时，码上有喜会生成您购买该商品的订单。需要填写您的收货人姓名、收货地址以及手机号码；您可以另外填写收货人的固定电话、邮箱地址信息以增加更多的联系方式确保商品可以准确送达。 如果您购买的海外跨境商品，我们还将进一步要求您提供身份证号码进行真实身份验证，同时作为报关信息中的必要信息提供给到海关。
          <br />上述所有信息构成您的"订单信息"，我们将使用您的订单信息来进行您的身份核验、确定交易、支付结算、完成配送、为您查询订单以及提供客服咨询与售后服务；我们还会使用您的订单信息来判断您的交易是否存在异常以保护您的交易安全。
          <br />（ 2 ）收藏、加购、关注与分享功能
          <br />在您浏览我们网站或客户端的过程中，您可以选择对感兴趣的商品及 / 或服务进行收藏、添加至购物车、与您感兴趣的商家 / 品牌 / 其他会员建立关注关系、通过我们提供的功能组件向第三方分享商品 / 服务信息。在您使用上述功能的过程中，我们会收集包括您的收藏及添加购物车的记录、关注关系、分享历史在内的服务日志信息用于实现上述功能及其他我们明确告知的目的。您可以在收藏夹、购物车管理或删除您的收藏和加购信息。
          <br />（ 3 ）退款售后功能
          <br />码上有喜平台退款售后功能会使用您的账号信息和订单信息。为保证您的账号安全，我们客服会使用您的账号信息与您核验您的身份。当您需要我们提供与您订单信息相关的退款售后服务时， 我们将会查询您的订单信息。您有可能会在与我们的客服人员沟通时，提供给出上述信息外的其他信息，如当您要求我们变更配送地址、联系人或联系电话。
          <br />（ 4 ）保障交易安全所必须的功能
          <br />为提高您使用我们的产品与 / 或服务时系统的安全性，更准确地预防钓鱼网站欺诈和保护账号安全，我们可能会通过了解您的浏览信息、订单信息、您常用的软件信息、设备信息等手段来判断您的账号风险，并可能会记录一些我们认为有风险的链接（" URL" ）； 我们也会收集您的设备信息对于码上有喜系统问题进行分析、统计流量并排查可能存在的风险、在您选择向我们发送异常信息时予以排查。
          <br />（ 5 ）为您提供评论、问答等信息公开发布功能
          <br />您可通过我们为您提供的评论、问答、论坛、个人主页分享、直播及其他信息发布功能公开发布信息，包括作为会员可发布图文 / 视频 / 直播内容、发表评价及问答内容等。我们可能会根据您的会员类型及网络日志信息判断您是否可享受对应功能权限。
          <br />请注意，您公开发布的信息中可能会涉及您或他人的个人信息甚至个人敏感信息，如您在评价时选择上传包含个人信息的图片。请您更加谨慎地考虑，是否在使用我们的服务时共享甚至公开分享相关信息。若您公开发布的信息中涉及他人个人信息的，您需在发布前征得他人的同意。
          <br />（ 6 ）对于上述您的个人信息，大部分是由您主动向我们提供的，也有我们在您使用我们的产品或服务时通过 Cookies 、 SDK 及类似技术获取的，还有部分是从第三方间接获取的。
          <br />8 、支付功能和产品交付
          <br />（1）码上有喜提供的在线健康咨询和在线问诊功能、处方开药或在线购物、成长测评等服务均为收费服务，同时码上有喜还为用户提供"讲堂"付费课程，在线购物服务，当您选择在码上有喜平台使用或购买该类服务和/产品时，需要进行支付，在按照平台完成交易和支付的过程中，我们可能会收集您的 第三方支付账号（如支付宝账号、微信支付账号、银行卡信息等） 用于充值或付款以及验证。 支付服务本身并不收集您的个人信息，但我们需要将您的订单号与交易金额信息与这些支付机构共享以实现其确认您的支付指令并完成支付。
          <br />（ 2 ）在当您下单后， 为了向您交付您购买的商品或服务，码上有喜还需要收集您的 订单及收货地址信息，包括收货人、地址、手机号码 用于向您寄送相应的物品。由我们的合作供应商或第三方配送公司 （包括顺丰、圆通等，以下称"配送公司"） 为您完成产品的配送。 您知晓并同意码上有喜合作第三方供货公司及第三方配送公司会在上述环节内使用您的订单信息以保证您的订购的商品能够安全送达。
          <br />（ 3 ）您可以请求其他人为您付款，那么您需要提供代付人的微信、支付宝账户及 / 或手机号码。为使我们及时获悉并确认您的支付进度及状态，为您提供售后与争议解决服务，您同意我们可自您所选择的交易对象、微信、支付宝或您选择的其他金融机构处收集与支付进度相关信息。
          <br />（三）提供或改进我们的产品和 / 或服务所需要的附加功能
          <br />1 、位置信息
          <br />当您通过设备使用我们的相关服务时，我们可能会收集和处理有关您的位置信息、行踪轨迹、网络身份标识信息等，例如来自您的设备的传感器数据就可以提供附近 Wi-Fi 接入点和基站的信息或者通过 IP 地址、蓝牙、GPS 等获取您的信息。
          <br />2 、客户服务或售后
          <br />当您向码上有喜平台提起投诉、申诉或进行评价以及处理售后服务问题时，为了方便与您联系或帮助您解决问题， 我们可能需要您提供姓名、手机号码、电子邮件及其他联系方式等个人信息。 如您拒绝提供上述信息，我们可能无法向您及时反馈投诉、申诉或咨询结果。
          <br />3 、个性化推送功能
          <br />我们会基于收集的信息，对您的偏好、习惯、位置作特征分析和用户画像，以便为您提供更适合的定制化服务，例如向您展现或推荐相关程度更高（而非普遍推送）的搜索结果、信息流或者广告/推广信息结果。为此，我们需要收集的信息包括您的 设备信息、浏览器型号、日志信息、浏览记录 。如您不需要该功能，您可关闭个性化推送服务。具体关闭方式见第五条第（四）款
          <br />4 、基于摄像头（相机）的附加功能：您可以使用这个附加功能完成视频通话、拍摄、拍照、扫码等功能。
          <br />5 、基于图片上传的附加功能：您可以在我们平台上传您的本地照片来实现发布信息以及评价等功能。
          <br />6 、基于语音技术的附加功能：您可以直接使用麦克风来进行语音咨询或与我们的客服机器人进行咨询和互动。
          <br />7 、安全保障服务：我们的产品集成友盟+SDK、个推+SDK，前述SDK需要收集您的设备Mac地址、唯一设备识别（IMEI/android ID/IDFA/OPENUDID/GUID、SIM卡MSI信息）、应用列表信息，以更好地识别当前设备、分析当前设备的风险等级、识别各种作弊行为、识别风险设备，从而评估渠道质量，识别恶意刷量、恶意程序，提升反欺诈能力，保护您的账号安全。
          <br />请您注意： 上述附加功能可能需要您在您的设备中向我们开启您的地理位置（位置信息）、相机（摄像头）、相册（图片库）、麦克风以及通讯录的访问权限，以实现这些功能所涉及的信息的收集和使用。 我们在您首次使用该类附加功能需开启相应权限时，弹窗对您进行提示，你选择开启相应权限，则可进一步使用相应服务 。同时 您可以到您的设备的【设置】中 找到关于"码上有喜 APP"的隐私设置情况逐项查看您上述权限的开启状态，并可以决定将这些权限随时的开启或关闭。
          <br />请您注意：您开启这些权限即代表您授权我们可以收集和使用这些个人信息来实现上述的功能，您关闭权限即代表您取消了这些授权，则我们将不再继续收集和使用您的这些个人信息，也无法为您提供上述与这些授权所对应的功能或服务。您关闭权限的决定不会影响此前基于您的授权所进行的个人信息的处理。
          <br />（四）我们通过间接方式收集到的您的个人信息
          <br />当您选择通过微信、Apple 登录第三方平台登录使用我们的产品和/或服务时，我们可能从第三方处获取您授权共享的的账户信息（头像、昵称），以及您的 Apple ID；同时您可能通过我们的产品和/或服务使用由我们的关联方、合作方提供的服务，您同意我们根据实际第三方平台的授权要求以及业务合作需求及情况，从该等第三方以及我们的关联方或合作方处接收、使用、汇总、分析经您授权同意其向我们提供的您的个人信息。
          <br />（五）需征得您同意的例外情形
          <br />您知晓，根据相关法律法规的规定，在以下情形中，我们可以在不征得您的知情同意的情况下而收集、使用相关个人信息：
          <br />1. 与国家安全、国防安全有关的；
          <br />2. 与公共安全、公共卫生、重大公共利益有关的；
          <br />3. 与犯罪侦查、起诉、审判和判决执行等有关的；
          <br />4. 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
          <br />5. 所收集的个人信息是个人信息主体自行向社会公众公开的；
          <br />6. 从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道；
          <br />7. 根据您的要求签订合同所必需的；
          <br />8. 用于维护所提供的产品与/或服务的安全稳定运行所必需的，例如发现、处置产品与/或服务的故障；
          <br />9. 为合法的新闻报道所必需的；
          <br />10. 学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
          <br />11. 法律法规规定的其他情形。
          <br />（六）个人敏感信息
          <br />在向平台在线提供任何属于敏感信息的个人信息前，请您清楚考虑这种提供是恰当的并且同意您的个人敏感信息可按本政策所述的目的和方式进行处理。 我们会在得到您的同意后收集和使用您的敏感信息以实现与平台在线业务相关的功能， 并允许您对这些敏感信息的收集与使用做出不同意的选择，但是拒绝使用这些信息会影响您使用相关功能。
          <br />如我们停止运营码上有喜产品或服务，我们将及时停止继续收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，并对我们所持有的与已关停业务相关的个人信息进行删除或匿名化处理。涉及儿童个人信息的，我们会并将停止运营的通知及时告知儿童监护人。
          <br />（七）如果您对我们收集和使用您的个人信息的法律依据有任何疑问或需要提供进一步的信息，请通过第八章节「如何联系我们」提供的联系方式与我们联系。
          <br />（八）当我们要将信息用于本政策未载明的其他用途时，会事先征求您的同意，当我们要将基于特定目的收集而来的信息用于其他目的是，会事先征求您的同意。请你知悉，我们向您提供的产品与 / 或服务将不断更新变化。如果您选择使用本隐私政策中尚未列明的其他产品与 / 或服务时，我们会在收集您的个人信息前通过协议、页面提示等方式向您详细说明信息收集的目的、方式、范围并征求您的同意。若您不同意提供前述信息，您可能无法使用该项产品与 / 或服务，但不影响您使用现有产品与 / 或服务。
          <br />二、我们如何使用 Cookie 和其他同类技术
          <br />（一）cookie
          <br />1、为确保网站正常运转，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie 通常包含标识符、站点名称以及一些号码和字符。借助于 Cookie，我们能够存储您的偏好或商品等数据，并用以判断注册用户是否已经登录，提升服务/产品质量及优化用户体验，通过得到的 Cookies 信息，为您提供个性化服务。
          <br />2、我们不会将 Cookie 用于本政策所述目的之外的任何用途。您可根据自己的偏好管理或删除 Cookie。您可以清除计算机上或手机中保存的所有 Cookie，大部分网络浏览器都设有阻止或禁用 Cookie 的功能，您可对浏览器进行配置；APP 设置中设有【清除缓存】功能。但如果您这么做，则需要在每一次访问我们的平台时亲自更改用户设置。阻止或禁用 Cookie 功能后，可能影响您使用或不能充分使用码上有喜提供的全部产品和/或服务。
          <br />（二）网站信标和像素标签
          <br />除 Cookie 外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件或短信中可能含有链接至我们网站内容的点击 URL。如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好并改善客户服务。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。
          <br />三、我们如何共享、转让与公开披露您的个人信息
          <br />（一）共享
          <br />1 、我们不会与码上有喜平台所属的孕安品牌旗下附属公司以外的任何公司、组织和个人共享您的个人信息，但以下情况除外：
          <br />(1) 在获取明确同意的情况下共享:获得您的明确同意后，我们会与其他方共享您的个人信息。
          <br />(2) 我们可能会根据法律法规规定，或按政府主管部门的强制性要求，对外共享您的个人信息。
          <br />(3) 只有共享您的信息，才能实现我们的产品与/或服务的核心功能或提供您需要的服务（此种情形我们将在情形发生时专门提示您），如处方开药和在线购物后需要完成产品的配送与交付，从而必须与与我们的合作商或第三方配送公司共享您的订单信息与收件信息。
          <br />(4) 与我们的附属公司共享：您的个人信息可能会与码上有喜所属的孕安品牌旗下的所有主体公司、附属公司、关联公司（以下统称 码上有喜附属公司 - 见第十章【定义和名词解释】 ）共享。我们只会共享必要的个人信息，且受本隐私政策中所声明目的的约束。附属公司如要改变个人信息的处理目的，将再次征求您的授权同意。
          <br />(5) 应您需求为您处理您与他人的纠纷或争议；
          <br />(6) 在法律法规允许的范围内，为维护我们以及我们的关联方或合作伙伴、您或其他码上有喜平台用户利益或社会公众利益、财产或安全免遭损害而有必要提供。
          <br />2、与授权合作伙伴共享：仅为实现本政策中声明的目的，我们的某些服务将由授权合作伙伴提供。我们可能会与合作伙伴共享您的订单信息、账号信息、设备信息以及位置信息，以保障服务的完成并提供更好的客户服务和用户体验。例如，在您购买我们的产品时，我们必须与物流服务提供商共享您的个人信息才能安排送货，或者安排合作伙伴提供服务。我们仅会出于合法、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于任何其他用途。如果您拒绝我们的合作伙伴在提供服务时收集为提供服务所必须的个人信息，将可能导致您无法在码上有喜平台使用该第三方服务。
          <br />我们的合作伙伴包含以下类型：
          <br />接入的第三方SDK 服务目录
          <br />（1）推送服务供应商：由浙江每日互动网络科技股份有限公司、友盟同欣（北京）科技有限公司为我们提供推送技术服务、统计分析服务，我们可能会将您的设备平台、设备厂商、设备品牌、设备识别码等设备信息，应用列表信息、网络信息以及位置相关信息提供给浙江每日互动网络科技股份有限公司、友盟同欣（北京）科技有限公司，用于为您提供相应的服务，详细内容请访问《个推用户隐私政策》、《友盟隐私政策》。
          <br />（2）商品或技术服务的供应商。我们可能会将您的个人信息共享给支持我们功能的第三方。这些支持包括为我们的供货或提供基础设施技术服务、代表我们发出短信的通讯服务供应商、物流配送服务、支付服务、数据处理等。我们共享这些信息的目的是可以实现我们产品与/或服务的核心功能，比如在线购药时我们必须与药品合作供应商以及其选定的物流服务提供商共享您的订单信息才能安排送货；或者我们需要将您的订单号和订单金额与第三方支付机构共享以实现其确认您的支付指令并完成支付等。
          <br />（3）分析服务类的授权合作伙伴。 在征得您的许可，我们可能将不能识别您的个人身份信息的统计或匿名信息共享给提供分析服务的合作伙伴。对于分析数据的伙伴，为了更好的分析码上有喜平台用户的使用情况，我们可能向其提供码上有喜用户的数量、地区分布、活跃情况等数据，但我们仅会向这些合作伙伴提供不能识别个人身份的统计或匿名信息。
          <br />（4）委托我们进行推广的合作伙伴。有时我们会代表其他企业向使用我们产品与/或服务的用户群提供促销推广的服务。我们可能会使用您的个人信息以及您的非个人信息集合形成的间接用户画像与委托我们进行推广的合作伙伴（"委托方"）共享，但我们仅会向这些委托方提供推广的覆盖面和有效性的信息，而不会提供您的个人身份信息，或者我们将这些信息进行汇总，以便它不会识别您个人。比如我们可以告知该委托方有多少人看了他们的推广信息或在看到这些信息后购买了委托方的商品，或者向他们提供不能识别个人身份的统计信息，帮助他们了解其受众或顾客。 对我们与之共享个人信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照法律法规规范等的要求、我们的说明、本隐私政策以及其他任何相关的保密和安全措施来处理个人信息。
          <br />（二）转让
          <br />我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：
          <br />1. 在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；
          <br />2. 根据适用的法律法规、法律程序的要求、强制性的行政或司法要求所必须的情况进行提供；
          <br />3. 在涉及合并、收购或破产清算时，如涉及到个人信息转让，我们会在要求新的持有您个人信息的公司、组织继续受此隐私政策的约束，否则我们将要求该公司、组织重新向您征求授权同意。
          <br />（三）公开披露
          <br />我们仅会在以下情况下，公开披露您的个人信息：
          <br />1. 获得您明确同意后；
          <br />2. 基于法律的披露：在法律、法律程序、诉讼或政府主管部门强制性要求的情况下，我们可能会公开披露您的个人信息；
          <br />3. 在符合法律法规的前提下，当我们收到上述披露信息的请求时，我们会要求必须出具与之相应的法律文件，如传票或调查函。我们坚信，对于要求我们提供的信息，应该在法律允许的范围内尽可能保持透明。
          <br />（四）共享、转让、公开披露个人信息时事先征得授权同意的例外
          <br />在以下情形中，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：
          <br />1. 与国家安全、国防安全直接相关的；
          <br />2. 与公共安全、公共卫生、重大公共利益直接相关的；
          <br />3. 与犯罪侦查、起诉、审判和判决执行等直接相关的；
          <br />4. 出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
          <br />5. 您自行向社会公众公开的个人信息；
          <br />6. 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；
          <br />7. 根据个人信息主体要求签订和履行合同所必需的；
          <br />8. 用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；
          <br />9. 法律法规规定的其他情形。
          <br />根据法律规定，共享、转让经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。
          <br />四、我们如何保存和保护您的个人信息
          <br />（一）个人信息的保存
          <br />1、保存期限：请您注意，在您在使用我们的产品与/或服务时所提供的所有个人信息，除非您删除或通过系统设置拒绝我们收集，我们将在您使用我们的产品和/或服务期间持续授权我们持续使用。在您申请注销账号并时，我们将停止使用并删除您的个人信息，具体详情见《码上有喜账号注销须知》。
          <br />2、保存地域：上述信息将存储于中华人民共和国境内。如需跨境传输，我们将会在符合国家对于信息出境的相关法律规定情况下，再单独征得您的授权同意。
          <br />（二）个人信息的保护
          <br />1 、安全措施
          <br />（1）我们已使用符合业界标准的安全防护措施保护您提供的个人信息，防止数据遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会采取一切合理可行的措施，保护您的个人信息。
          <br />（2）我们会使用加密技术确保数据的保密性；我们会使用受信赖的保护机制防止数据遭到恶意攻击。
          <br />（3）我们会部署访问控制机制，确保只有授权人员才可访问个人信息；我们会与接触您个人信息的员工、合作伙伴签署保密协议，明确岗位职责及行为准则，确保只有授权人员才可访问个人信息。若有违反保密协议的行为，会被追究相关责任。
          <br />（4）我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
          <br />（5）我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。
          <br />（6）我们已经取得了国家信息安全等级保护（三级）的评测与备案。
          <br />2 、安全提醒
          <br />（1）互联网并非绝对安全的环境，而且电子邮件、即时通讯、及与其他用户的交流方式并未加密，我们强烈建议您不要通过此类方式发送个人信息。请使用复杂密码，协助我们保证您的账号安全。
          <br />（2）互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
          <br />（3）您在使用码上有喜平台服务时请勿将自认为隐私的信息发表、上传至码上有喜平台，也不可将该等信息通过码上有喜平台的服务器传播给他人，若因您该等行为引起隐私泄露，由您自行承担责任。
          <br />（4）您请勿在使用码上有喜平台服务时公开透露自己的各类财产账户、银行卡、信用卡、第三方支付账户及对应密码等重要资料，否则由此带来的损失由您自行承担责任。
          <br />（5）码上有喜平台一旦发现假冒、仿冒、盗用他人名义进行平台认证的，码上有喜平台有权立即删除用户信息并有权在用户提供充分证据签禁止其使用平台服务。
          <br />3 、安全事件通知
          <br />（1）我们会制定相应的网络安全事件应急预案，及时处置系统漏洞、计算机病毒、网络攻击、网络侵入等安全风险，在发生危害网络安全的事件时，我们会立即启动应急预案，采取相应的补救措施。
          <br />（2）在不幸发生个人信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。
          <br />（3）如您发现自己的个人信息泄密，尤其是您的账户及密码发生泄露，请您立即通过码上有喜平台提供的以及本政策第八章节的【如何联系我们】与 APP 中【联系客服】中提供的联系方式联络我们，以便我们采取相应措施。
          <br />五、您的权利
          <br />按照中国相关的法律、法规、标准，以及其他国家、地区的通行做法，我们保障您对自己的个人信息行使以下权利：
          <br />（一） 访问您的个人信息
          <br />1、您有权访问您的个人信息，法律法规规定的例外情况除外。如果您想行使数据访问权，可以通过以下方式自行访问:
          <br />1）账户信息——您可以通过：【登录码上有喜 APP → 我的 → 设置】中查看您的头像、昵称、性别等信息，并通过该页面中"账号管理"中查询您 的手机号码，Apple ID 信息。 &emsp;2）患者信息——您可通过：【登录码上有喜 APP → 我的 → 患者信息】中查看您已创建的患者信息的详情。 &emsp;3）问诊/处方/药品订单/讲堂课程/成长测评等信息——您可以通过【登录码上有喜 APP → 我的】页面中点击查看相应菜单信息，访问您使用过的服务或相关订单信息。
          <br />4）您可以通过【登录码上有喜 APP →我的】中查看课程订单和/或好物订单，以及订单待收款/待收货/退换售后情况。
          <br />2、对于您在使用我们的产品或服务过程中产生的其他个人信息，只要我们不需要过多投入，我们会向您提供。如果您想行使数据访问权，可以通过本隐私政策第八章节的【如何联系我们】或通过 APP 中【联系客服】提供的联系方式与我们联系。
          <br />（二） 更正您的个人信息
          <br />1、除法律法规规定外，您有权随时更正您的个人信息，具体包括：
          <br />（1）您可通过 APP 上【我的 → 设置 】，修改您用户名绑定的手机号码。 &emsp;（2）您可通过 APP 上【我的 → 患者信息】，修改您的患者信息（经患者信息经过了身份证核验，因此将不可更改性别）。
          <br />（3）您可以通过【登录码上有喜 APP →我的→设置→收货地址】中随时添加、更改、删除、管理您的收货地址信息（包括收货人姓名、收货地址、收货人的电话号码或邮箱）， 您也可以将最常用的收货地址设置为默认地址。
          <br />2、如果您需要查阅您在使用码上有喜过程中产生的其他个人信息，在合理要求下并经验证核实您的身份后，我们会向您提供。若您无法通过上述方式访问或者更正您的个人信息，也可以通过本隐私政策第八章节的【如何联系我们】提交或通过 APP 中【联系客服】向我们进行反馈。我们会在 5 个工作日内回复您的查阅请求。
          <br />（三） 删除您的个人信息
          <br />1、我们在码上有喜平台上提供以下方式帮助您删除您在码上有喜平台上的部分相关信息。
          <br />(1) 如您可在 APP 中【我的问诊】信息中删除您具体的问诊问题；可在【我的处方】删除处方信息；可在【药品订单】中删除订单信息；可在【订单】中删除购物的订单信息，可删除【患者信息】等。(2) 您可通过 APP【我的 → 设置 → 清空缓存】，删除您在码上有喜平台的浏览记录；
          <br />2、 如果您需要删除您在使用码上有喜过程中产生的其他个人信息， 在合理要求并经验证核实您的身份后 ，我们会向您提供。您也可以通过本隐私政策第八章节的【如何联系我们】提交或通过 APP 中【联系客服】向我们进行反馈。我们会 5 个工作日回复您的删除请求。
          <br />3、 在以下情形中，您可以向我们提出删除个人信息的请求：
          <br />(1) 如果我们处理个人信息的行为违反法律法规；
          <br />(2) 如果我们收集、使用您的个人信息，却未征得您的同意；
          <br />(3) 如果我们处理个人信息的行为违反了与您的约定；
          <br />(4) 如果您注销了个人在线帐号；
          <br />(5) 如果我们终止服务及运营。
          <br />4、若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。
          <br />5、当您从我们的服务中删除信息后，我们可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。
          <br />（四）改变您授权同意的范围或撤回您的授权
          <br />对于您个人信息的收集和使用，您可以在码上有喜 APP 上随时通过以下方式给予或收回您的授权同意。
          <br />1. 您可通过 APP【我的 → 设置】中来设置密码来保护您的个人信息；
          <br />2. 您可通过 APP【我的 → 设置 → 隐私设置】中或者在 您的手机设备中的【设置】 来开启或关闭码上有喜平台的消息通知推送。当您收回同意后，我们将不再处理相应的个人信息，但请您理解，当您撤回同意或授权后，我们无法继续为您提供撤回同意或授权所对应的特定功能和/或服务。但您收回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。
          <br />3. 您可通过 APP【我的 →设置 →消息通知】来关闭个性化推送服务。当您关闭个性化推送服务后，我们将暂停向您展现或推荐相关程度更高（而非普遍推送）的搜索结果、信息流或者广告/推广信息结果。
          <br />4. 您可通过 APP【我的 → 设置】中删除您的个人信息，您也可以通过注销账号的形式撤回我们对您个人信息收集的全部授权或通过第八章节的【如何联系我们】或 APP 中【联系客服】进行相应的授权变更。当您撤回同意或授权后，我们不再继续为您提供撤回同意或授权后所对应的服务，也无法处理您相应个人信息，但您撤回同意或授权的决定，不会影响此前基于您的授权而使用开展的个人信息的处理。
          <br />（五） 设备权限调用
          <br />我们在提供服务的过程中，可能需要您开通一些设备权限，例如通知、相册、相机、手机通讯录、蓝牙等访问权限。 您也可以在 您的设备的【设置】 功能中随时选择关闭部分或者全部权限，从而拒绝我们收集您相应的个人信息。在不同设备中，权限显示方式及关闭方式可能有所不同，具体请参考设备及系统开发方说明或政策。
          <br />（六）注销您的帐号
          <br />1、您可以在我们的平台中直接申请注销账户，具体可通过平台中【我的-设置-账号管理-注销账号】中提供的删除或注销申请入口或【联系客服】中提供的联系方式，向我们申请注销和删除您的信息。关于您注销账户的方式以及您应满足的条件，请详见附件《码上有喜账户注销须知》。您注销账户后，我们将停止为您提供产品与/或服务，并依据您的要求，除法律法规另有规定外，我们将删除您的个人信息。
          <br />2 、如果您不想接受我们给您发送的通知推送或短信推送，您随时可通过以下方式取消：
          <br />（1）您可通过 PC 端账户设置页面的邮件订阅菜单中取消邮件订阅的推送信息。
          <br />（2）您可以根据收到的短信内容的提示，随时回复"T"或"TD"来取消我们给您发送的手机推送短信。
          <br />（3）您可以通过移动端 APP 您可通过【我的 → 设置】中或者在您的设备中的【设置】来开启或关闭码上有喜平台的通知推送。
          <br />（4）为了保护您的隐私，我们不会以任何方式和途径向您推送涉及宗教信仰、性、疾病等相关敏感内容或信息给您。
          <br />（七） 获取个人信息副本
          <br />您有权获取您的个人信息副本，您可以通过访问网站和 APP 中的【联系客服】向我们进行反馈，我们将在 5 个工作日内对您的请求进行处理。
          <br />（八） 约束信息系统自动决策
          <br />在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将提供适当的救济方式。您可以通过网站和 APP 中的【联系客服】向我们进行反馈，我们将在不侵害码上有喜平台商业秘密或其他用户权益、社会公共利益的前提下，在 5 个工作日内对您的请求进行处理。
          <br />（九）响应您的上述请求
          <br />为保障安全，我们可能会先要求您验证自己的身份，然后再处理您的请求。您可能需要提供书面请求，或以其他方式证明您的身份。对于您的请求，我们原则上将于 5 个工作日内做出答复。 对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。
          <br />（十）在以下情形中，按照法律法规要求，我们将无法响应您的请求：
          <br />1. 与国家安全、国防安全直接相关的
          <br />2. 与公共安全、公共卫生、重大公共利益直接相关的；
          <br />3. 与犯罪侦查、起诉、审判和判决执行等直接相关的；
          <br />4. 有充分证据表明您存在主观恶意或滥用权利的；
          <br />5. 响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；
          <br />6. 涉及商业秘密的。
          <br />六、我们如何处理儿童的个人信息
          <br />1. 我们的产品、网站和服务主要面向成人。如果没有父母或监护人的同意，儿童不得创建自己的用户账户。
          <br />2. 对于码上有喜平台提供的【成长测评】、【孕育管家】及其它会涉及儿童的产品和/或服务，以及父母为其子女在码上有喜平台进行在线问诊的，需经父母（监护人）同意而收集儿童个人信息的情况，我们只会在受到法律允许、父母或监护人明确同意或者保护儿童所必要的情况下收集、使用或公开披露此信息。
          <br />3. 尽管当地法律和习俗对儿童的定义不同，但我们将不满 14 周岁的任何人均视为儿童。
          <br />4. 如果我们发现自己在未事先获得可证实的父母同意的情况下收集了儿童的个人信息，则会设法尽快删除相关数据。
          <br />5. 若您是未成年人的监护人，当您对您所监护的未成年人使用我们的服务或其向我们提供的用户信息有任何疑问时，请您及时与我们联系。我们将根据国家相关法律法规及本政策的规定保护未成年人用户信息的保密性及安全性。如果我们发现自己在未事先获得可证实的父母或法定监护人同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关数据。
          <br />七、本政策更新及通知
          <br />1、 我们的隐私政策可能变更。
          <br />2、 未经您明确同意，我们不会削减您按照本隐私政策所应享有的权利。我们会在本页面上发布对本政策所做的任何变更。
          <br />3、 对于重大变更，我们可能还会提供更为显著的通知 ( 包括对于某些服务，我们会通过电子邮件、站内信、短信、 APP 通知、弹窗等方式发送通知，说明隐私政策的具体变更内容)。
          <br />4、本政策 重大变更 包括但不限于：
          <br />(1) 我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；
          <br />(2) 我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；
          <br />(3) 个人信息共享、转让或公开披露的主要对象发生变化；
          <br />(4) 您参与个人信息处理方面的权利及其行使方式发生重大变化；
          <br />(5) 我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化；
          <br />(6) 个人信息安全影响评估报告表明存在高风险时。
          <br />5、若您不同意修改后的隐私保护政策，您有权并应立即停止使用码上有喜服务。如果您继续使用码上有喜平台的服务，则视为您接受码上有喜对本政策相关条款所做的修改。
          <br />
          <br />感谢您对码上有喜平台以及码上有喜产品和 / 或服务的信任和使用！
          <br />杭州码上有喜科技有限公司
          <br />
          <br />附件一：《码上有喜账号注销须知》
          <br />一. 亲爱的码上有喜用户，您可在码上有喜 APP 通过以下两种方式任选其一注销您在平台中的账号并删除账号信息：
          <br />1. 通过 APP 中【我的-设置-账号管理-注销账号】项下提供的账号注销方式自主完成注销。
          <br />2. 通过 APP 中提供的【联系客服】向我们申请注销，申请时请您按照客服人员要求提供相关材料，客服人员核实您的身份后，将在 5 个工作日内完成您的账号注销。
          <br />二. 您在向我们申请注销前，应当认真阅读《账号注销须知》（以下称"《注销须知》"），请您务必审慎阅读、充分理解协议中相关条款内容。
          <br />【特别提示】
          <br />（1）当您按照注销页面提示填写信息、阅读并同意本《注销须知》及相关条款与条件且完成全部注销程序后，即表示您已充分阅读、理解并接受本《注销须知》的全部内容。阅读本《注销须知》的过程中，如果您不同意相关任何条款和条件约定，请您立即停止账号注销程序。我们在此善意地提醒您，您注销账号的行为会给您的售后维权带来诸多不便，且注销账号后，您的个人信息我们只会在系统中去除，使其保持不可被检索、访问的状态，或对其进行匿名化处理。您知晓并理解，根据相关法律规定，相关交易记录将会在后台保存 5 年甚至更长的时间。
          <br />（2）请您确认并知悉：您使用的本平台的服务系互联网医疗品牌【码上有喜旗下】的多个服务之一，码上有喜旗下所有互联网产品和服务使用一个用户账号系统，当您向我们申请注销您在码上有喜 APP 的账号时，一旦该账号被注销掉后，您将无法使用此账号以及此账号关联的手机括号登录使用【码上有喜旗下】的其它平台服务（如孕安等）。
          <br />三. 如果您仍执意注销账号，您的账号需同时满足以下条件:
          <br />1. 在最近一个月内，账号没有进行更改密码、找回密码、更改绑定信息等敏感操作；
          <br />2. 自愿放弃账号在系统中的资产和虚拟权益（包括但不限于账号余额、优惠券、虚拟币、积分等）自愿放弃、无拍卖保证金、无欠款；
          <br />3. 账号内无未完成的订单和服务；
          <br />4. 您的账号及通过您的账号接入的第三方中没有未完成或存在争议的服务；
          <br />5. 账号无任何纠纷，包括投诉举报或被投诉举报；
          <br />6. 账号为正常使用中且 1 年内无任何账号被限制的记录；
          <br />7. 账号已经解除与其他网站、其他 APP 的授权登录或绑定关系；
          <br />8. 账号无任何纠纷，包括投诉举报。
          <br />四. 账号一旦被注销将不可恢复，请您在操作之前自行备份您需要的账号相关的所有信息和数据。请您保存好订单商品和服务的交易凭证、票据等资料，否则您有可能须支付额外的账号和订单查询费用，或无法享受售后服务。
          <br />五. 在账号注销期间，如果您的账号涉及争议纠纷，包括但不限于投诉、举报、诉讼、仲裁、国家有权机关调查等，平台有权自行终止本账号的注销流程而无需另行得到您的同意。
          <br />六. 注销账号，您将无法再使用本账号，也将无法找回您账号中及与账号相关的任何内容或信息，包括但不限于：
          <br />1. 您将无法登录、使用本账号；
          <br />2. 本账号的个人资料和历史信息（包括但不限于用户名、头像、浏览记录、购买记录、收藏信息、关注信息等）都将无法找回；
          <br />3. 您通过账号使用、授权登录或绑定账号后使用的平台相关或第三方的其他服务的所有记录将无法找回。您将无法再登录、使用前述服务，您曾获得的余额、优惠券、积分、资格、订单、内容及其账号上所有的其他内容权益等视为您自行放弃，将无法继续使用或找回。您理解并同意，平台无法协助您重新恢复前述服务。请您在提交注销申请前，务必先了解您须解绑的其他相关账号信息，具体可通过【联系客服】等方式进行联系本平台。
          <br />七. 注销本账号后，您将放弃以下权益和资产：
          <br />1. 账号信息、会员权益、虚拟资产、历史账号信息、历史账号使用信息且无法恢复；
          <br />2. 无法使用账号原验证手机或邮箱登录本平台服务；
          <br />3. 解除与第三方授权或绑定关系。
          <br />您理解并同意，我们无法协助您重新恢复前述服务，您注销账号的行为会给您的售后维权带来诸多不便，请您在操作之前，确保您的账号无任何纠纷，并自行备份我们账号相关的所有信息和数据，下载并保存好订单商品和服务的交易凭证、票据（如电子发票）等资料，否则您有可能须支付额外的账号和订单查询费用或无法享受相关售后服务。
          <br />八. 注销账号并不代表本账号注销前的账号行为和相关责任得到豁免或减轻。
          <br />如您对本《注销须知》有任何疑问，可根据平台中【联系客服】进行联系。
        </p>
        <p>
          <br />
        </p>
      </div>
    </div>
    <div class="home-footer">
      <span class="clause" @click="$router.push('/clause')">孕安《服务条款》《隐私保护》</span>
      <span>Copyright © 2021 -2023 All Right Reserved 码上有喜版权所有</span>
    </div>
  </div>
</template>
<script>
export default {
  data() {
    return {};
  },
  components: {},
  mounted() {}
};
</script>
<style lang='less'>
.page-clause {
  display: flex;
  flex-direction: column;
  align-items: center;
  width: 100%;
  background: #f0f2f4;
  .logo-line {
    width: 100%;
    max-width: 1200px;
    padding: 0 30px;
    margin-top: 38px;
    .icon-logo {
      cursor: pointer;
      display: inline-block;
      width: 138px;
      height: 46px;
      background: url("./images/logo.png") no-repeat;
      background-size: contain;
    }
  }
  .clause-info {
    display: flex;
    flex-direction: column;
    align-items: center;
    width: 100%;
    max-width: 1200px;
    padding: 80px 30px 80px;
    .info-title {
      font-size: 28px;
      font-weight: 500;
      color: #333333;
      line-height: 40px;
      margin-bottom: 31px;
    }
    .info-desc {
      display: flex;
      flex-direction: column;
      font-size: 14px;
      font-weight: 400;
      color: #333333;
      line-height: 20px;
    }
  }
  .home-footer {
    display: flex;
    flex-direction: column;
    align-items: center;
    justify-content: center;
    width: 100%;
    height: 65px;
    background: #3A3A3A;
    font-size: 14px;
    font-weight: 400;
    color: #C3C3C3;
    line-height: 23px;
    margin-top: 80px;
    .clause {
      cursor: pointer;
    }
  }

  @media screen and (max-width: 828px) {
    .clause-info {
      padding: 64px 30px 20px;
      .info-desc {
        line-height: 30px;
      }
    }
    .home-footer {
      width: 100%;
      height: 120px;
      background: #3A3A3A;
      font-size: 24px;
      font-weight: 400;
      color: #C3C3C3;
      line-height: 36px;
      .clause {
        cursor: pointer;
      }
    }
  }
}
</style>